openwch/ch32x315/EVT/EXAM/SRC/Peripheral/src/ch32x3x5_usart.c
    return bitstatus;
}

/*********************************************************************
 * @fn      USART_ClearITPendingBit
 *
 * @brief   Clears the USARTx's interrupt pending bits.
 *
 * @param   USARTx - where x can be 1 to 4 to select the USART peripheral.
 *          USART_IT - specifies the interrupt pending bit to clear.
 *            USART_IT_LBD - LIN Break detection interrupt.
 *            USART_IT_TC - Transmission complete interrupt.
 *            USART_IT_RXNE - Receive Data register not empty interrupt.
 *         Note-
 *            - PE (Parity error), FE (Framing error), NE (Noise error), ORE (OverRun 
 *            error),  MS_ER(Mask or Space Parity Error) 
 *              and IDLE (Idle line detected) pending bits are cleared by 
 *            software sequence: a read operation to USART_STATR register 
 *            (USART_GetITStatus()) followed by a read operation to USART_DATAR register 
 *            (USART_ReceiveData()).
 *            - RXNE pending bit can be also cleared by a read to the USART_DATAR register 
 *            (USART_ReceiveData()).
 *            - TC pending bit can be also cleared by software sequence: a read 
 *            operation to USART_STATR register (USART_GetITStatus()) followed by a write 
 *            operation to USART_DATAR register (USART_SendData()).
 *            - TXE pending bit is cleared only by a write to the USART_DATAR register 
 *            (USART_SendData()).
 * @return  none
 */
void USART_ClearITPendingBit(USART_TypeDef *USARTx, uint16_t USART_IT)
{
    uint16_t bitpos = 0x00, itmask = 0x00;

    bitpos = USART_IT >> 0x08;
    itmask = ((uint16_t)0x01 << (uint16_t)bitpos);
    USARTx->STATR = (uint16_t)~itmask;
}

/*********************************************************************
 * @fn      USART_LPWKUPConfig
 *
 * @brief   Enables or disables the specified USART low power wake up.
 *
 * @param   USARTx - where x can be (1~4) to select the USART peripheral.
 *          LPWKUP_DLY - delay low power wake up clock cycle.
 *            USART_LPWKUP_DLY_x_CLKCycle - x can select(1~7)
 *          LPWKUP_CLK_SRC - low power wake up clock source
 *            USART_LPWKUP_CLK_SRC_LSI - LSI as low power wake up clock source.
 *            USART_LPWKUP_CLK_SRC_LSE - LSE as low power wake up clock source.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void USART_LPWKUPConfig(USART_TypeDef *USARTx, uint16_t LPWKUP_DLY , uint16_t LPWKUP_CLK_SRC, FunctionalState NewState)
{
    USARTx->CTLR3 &= ~(USART_CTLR3_LPWKUP_DLY_CFG | USART_CTLR3_LPWKUP_CK_SRC | USART_CTLR3_LPWKUP_EN);
    USARTx->CTLR3 |= (LPWKUP_DLY | LPWKUP_CLK_SRC);

    if(NewState != DISABLE)
    {
       USARTx->CTLR3 |= USART_CTLR3_LPWKUP_EN;
    }
}

/*********************************************************************
 * @fn      USART_MARKorSPACE_Config
 *
 * @brief   Selects the USART mark or space mode.
 *
 * @param   USARTx - where x can be (1~4) to select the USART peripheral.
 *          MARKorSPACE_Mode - specifies the USART mark or space mode.
 *            USART_VerifyMode_NoMARKorSPACE - Close the USART mark or space mode.
 *            USART_VerifyMode_MARK - Open the USART mark mode.
 *            USART_VerifyMode_SPACE - Open the USART space mode.
 *
 * @return  none
 */
void USART_MARKorSPACE_Config(USART_TypeDef *USARTx, uint16_t MARKorSPACE_Mode)
{
    USARTx->CTLR4 &= ~USART_CTLR4_CHECK_SEL;
    USARTx->CTLR4 |= MARKorSPACE_Mode;
}

/*********************************************************************
 * @fn      USART_ForceTXOpenDrainCmd
 *
 * @brief   Enables or disables the USART force TX open drain.
 *
 * @param   USARTx - where x can be (1~4) to select the USART peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void USART_ForceTXOpenDrainCmd(USART_TypeDef *USARTx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        USARTx->CTLR4 |= USART_CTLR4_SELF_OD;
    }
    else
    {
        USARTx->CTLR4 &= ~USART_CTLR4_SELF_OD;
    }
}